Revit 2027 API
SpecTypeId.PipingSlope Property
 Slope, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingSlope { get; }
Public Shared ReadOnly Property PipingSlope As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingSlope {
	ForgeTypeId^ get ();
}
static member PipingSlope : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace